[Killed] MethodExpression
src/domain/greeting/greeting.ts:11:7
 }>;
 
 export function createGreeting(id: GreetingId, userId: UserId, name: string): Greeting {
-  if (name.trim().length === 0) {
+  if (name.length === 0) {
     throw new Error('Name must not be empty.');
   }
killedBy: createGreeting should throw if the name is only whitespace
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/domain/greeting/greeting.ts:11:7
 }>;
 
 export function createGreeting(id: GreetingId, userId: UserId, name: string): Greeting {
-  if (name.trim().length === 0) {
+  if (name.trim().length !== 0) {
     throw new Error('Name must not be empty.');
   }
killedBy: createGreeting should create a greeting with the correct message
statusReason: Name must not be empty.

[Killed] MethodExpression
src/domain/greeting/greeting.ts:17:24
   return {
     id,
     userId,
-    message: `Hello, ${name.trim()}!`,
+    message: `Hello, ${name}!`,
     createdAt: new Date(),
   };
killedBy: createGreeting should trim whitespace from the name
statusReason: expected 'Hello,   Bob  !' to be 'Hello, Bob!' // Object.is equality

[Killed] StringLiteral
src/domain/greeting/greeting.ts:17:14
   return {
     id,
     userId,
-    message: `Hello, ${name.trim()}!`,
+    message: ``,
     createdAt: new Date(),
   };
killedBy: createGreeting should create a greeting with the correct message
statusReason: expected '' to be 'Hello, Alice!' // Object.is equality
