[Killed] BlockStatement
src/application/greet/greet-use-case.ts:11:99
   name: string;
 }>;
 
-export async function greet(command: GreetCommand, repository: GreetingRepository): Promise<void> {
-  const greeting = createGreeting(command.id, command.userId, command.name);
-  await repository.save(greeting);
-}
+export async function greet(command: GreetCommand, repository: GreetingRepository): Promise<void> {}
 
killedBy: greet use case should save a greeting via the repository
statusReason: expected undefined to be defined
