[Killed] BlockStatement
src/infrastructure/adapters/in-memory-greeting-repository.ts:8:49
 export class InMemoryGreetingRepository implements GreetingRepository {
   private readonly store = new Map<string, Greeting>();
 
-  async save(greeting: Greeting): Promise<void> {
-    this.store.set(greeting.id, greeting);
-  }
+  async save(greeting: Greeting): Promise<void> {}
 
   async findById(id: GreetingId): Promise<Greeting | undefined> {
killedBy: greet use case should save a greeting via the repository
statusReason: expected undefined to be defined
